# SetComponentSize

## Description
Sets the width and height of the specified Layout Manager component.

```pascal
FUNCTION SetComponentSize(
				nDialogID     : LONGINT;
				nComponentID  : LONGINT;
				nWidthPixels  : INTEGER;
				nHeightPixels : INTEGER) : BOOLEAN;
```

```python

def vs.SetComponentSize(nDialogID, nComponentID, nWidthPixels, nHeightPixels):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT||
|nComponentID|LONGINT||
|nWidthPixels|INTEGER||
|nHeightPixels|INTEGER||

## Version
Availability: from VectorWorks 2008
## Category
* Dialogs - Modern